{
  "หมวดวิชาศึกษาทั่วไป": {
    "กลุ่มวิชาพื้นฐาน": [
      {
        "code": "GE-010-001",
        "name": "ภาษาอังกฤษง่ายนิดเดียว",
        "credit": "3",
        "description": "รายวิชา \"ภาษาอังกฤษง่ายนิดเดียว\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "GE-010-002",
        "name": "ภาษาอังกฤษฟุดฟิดฟอฟัน",
        "credit": "3",
        "description": "รายวิชา \"ภาษาอังกฤษฟุดฟิดฟอฟัน\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "GE-010-003",
        "name": "ดิจิทัลกับชีวิตวิถีใหม่",
        "credit": "3",
        "description": "รายวิชา \"ดิจิทัลกับชีวิตวิถีใหม่\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "GE-010-004",
        "name": "คุณค่ามหาวิทยาลัยกาฬสินธุ์",
        "credit": "3",
        "description": "รายวิชา \"คุณค่ามหาวิทยาลัยกาฬสินธุ์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "GE-010-005",
        "name": "ชีวิตออกแบบได้",
        "credit": "3",
        "description": "รายวิชา \"ชีวิตออกแบบได้\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "GE-010-006",
        "name": "ปรัชญามนุษย์ สังคมและเศรษฐศาสตร์",
        "credit": "3",
        "description": "รายวิชา \"ปรัชญามนุษย์ สังคมและเศรษฐศาสตร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      }
    ],
    "กลุ่มวิชาเลือก": [
      {
        "code": "GE-020-003",
        "name": "ภาษาไทยเชิงสร้างสรรค์",
        "credit": "3",
        "description": "รายวิชา \"ภาษาไทยเชิงสร้างสรรค์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "GE-020-008",
        "name": "การพัฒนาธุรกิจในสังคมดิจิทัล",
        "credit": "3",
        "description": "รายวิชา \"การพัฒนาธุรกิจในสังคมดิจิทัล\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      }
    ]
  },
  "หมวดวิชาเฉพาะ": {
    "กลุ่มวิชาแกน": [
      {
        "code": "EN-001-001",
        "name": "เขียนแบบวิศวกรรม",
        "credit": "3",
        "description": "รายวิชา \"เขียนแบบวิศวกรรม\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-002",
        "name": "การโปรแกรมคอมพิวเตอร์",
        "credit": "3",
        "description": "รายวิชา \"การโปรแกรมคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-006",
        "name": "วิศวกรรมไฟฟ้าพื้นฐาน",
        "credit": "3",
        "description": "รายวิชา \"วิศวกรรมไฟฟ้าพื้นฐาน\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-007",
        "name": "ความน่าจะเป็นและสถิติวิศวกรรม",
        "credit": "3",
        "description": "รายวิชา \"ความน่าจะเป็นและสถิติวิศวกรรม\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-016",
        "name": "ระบบควบคุมอัตโนมัติ",
        "credit": "3",
        "description": "รายวิชา \"ระบบควบคุมอัตโนมัติ\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-017",
        "name": "วิศวกรรมหุ่นยนต์เบื้องต้น",
        "credit": "3",
        "description": "รายวิชา \"วิศวกรรมหุ่นยนต์เบื้องต้น\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-018",
        "name": "ปฏิบัติการการออกแบบวงจรอิเล็กทรอนิกส์ด้วยคอมพิวเตอร์",
        "credit": "1",
        "description": "รายวิชา \"ปฏิบัติการการออกแบบวงจรอิเล็กทรอนิกส์ด้วยคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-019",
        "name": "แก่นวิศวกรรมคอมพิวเตอร์",
        "credit": "3",
        "description": "รายวิชา \"แก่นวิศวกรรมคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-001-020",
        "name": "การเขียนโปรแกรมและแก้ปัญหา",
        "credit": "2",
        "description": "รายวิชา \"การเขียนโปรแกรมและแก้ปัญหา\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "SC-061-103",
        "name": "แคลคูลัสสำหรับวิศวกรรม 1",
        "credit": "3",
        "description": "รายวิชา \"แคลคูลัสสำหรับวิศวกรรม 1\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "SC-061-104",
        "name": "แคลคูลัสสำหรับวิศวกรรม 2",
        "credit": "3",
        "description": "รายวิชา \"แคลคูลัสสำหรับวิศวกรรม 2\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-101",
        "name": "คณิตศาสตร์ดิสครีต",
        "credit": "3",
        "description": "รายวิชา \"คณิตศาสตร์ดิสครีต\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-102",
        "name": "อิเล็กทรอนิกส์สำหรับวิศวกรรมคอมพิวเตอร์",
        "credit": "3",
        "description": "รายวิชา \"อิเล็กทรอนิกส์สำหรับวิศวกรรมคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-103",
        "name": "การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์",
        "credit": "3",
        "description": "รายวิชา \"การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-205",
        "name": "โครงสร้างข้อมูลและอัลกอริทึม",
        "credit": "3",
        "description": "รายวิชา \"โครงสร้างข้อมูลและอัลกอริทึม\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-206",
        "name": "สถาปัตยกรรมและโครงสร้างคอมพิวเตอร์",
        "credit": "3",
        "description": "รายวิชา \"สถาปัตยกรรมและโครงสร้างคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-207",
        "name": "ตรรกศาสตร์ของดิจิตอลคอมพิวเตอร์",
        "credit": "3",
        "description": "รายวิชา \"ตรรกศาสตร์ของดิจิตอลคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-208",
        "name": "ระบบปฏิบัติการและโปรแกรมระบบ",
        "credit": "3",
        "description": "รายวิชา \"ระบบปฏิบัติการและโปรแกรมระบบ\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-209",
        "name": "การเขียนโปรแกรมคอมพิวเตอร์ขั้นสูง",
        "credit": "3",
        "description": "รายวิชา \"การเขียนโปรแกรมคอมพิวเตอร์ขั้นสูง\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-210",
        "name": "ระบบสมองกลฝังตัว",
        "credit": "3",
        "description": "รายวิชา \"ระบบสมองกลฝังตัว\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-313",
        "name": "ระบบฐานข้อมูล",
        "credit": "3",
        "description": "รายวิชา \"ระบบฐานข้อมูล\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-314",
        "name": "ปัญญาประดิษฐ์",
        "credit": "3",
        "description": "รายวิชา \"ปัญญาประดิษฐ์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-315",
        "name": "วิศวกรรมซอฟต์แวร์",
        "credit": "3",
        "description": "รายวิชา \"วิศวกรรมซอฟต์แวร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-316",
        "name": "วิทยาการข้อมูลและการแสดงผลข้อมูล",
        "credit": "3",
        "description": "รายวิชา \"วิทยาการข้อมูลและการแสดงผลข้อมูล\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      }
    ],
    "กลุ่มวิชาเฉพาะด้าน": [],
    "กลุ่มวิชาเลือก": [
      {
        "code": "EN-013-XXX",
        "name": "วิชาเลือกสาขา 1",
        "credit": "3",
        "description": "รายวิชา \"วิชาเลือกสาขา 1\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-013-XXX",
        "name": "วิชาเลือกสาขา 2",
        "credit": "3",
        "description": "รายวิชา \"วิชาเลือกสาขา 2\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-013-XXX",
        "name": "วิชาเลือกสาขา 3",
        "credit": "3",
        "description": "รายวิชา \"วิชาเลือกสาขา 3\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-013-XXX",
        "name": "วิชาเลือกสาขา 4",
        "credit": "3",
        "description": "รายวิชา \"วิชาเลือกสาขา 4\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-013-XXX",
        "name": "วิชาเลือกสาขา 5",
        "credit": "3",
        "description": "รายวิชา \"วิชาเลือกสาขา 5\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      }
    ],
    "กลุ่มวิชาประสบการณ์ภาคสนาม": [
      {
        "code": "EN-012-104",
        "name": "การสัมมนาทางวิศวกรรมคอมพิวเตอร์",
        "credit": "1",
        "description": "รายวิชา \"การสัมมนาทางวิศวกรรมคอมพิวเตอร์\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-211",
        "name": "โครงงานวิศวกรรมคอมพิวเตอร์ 1",
        "credit": "1",
        "description": "รายวิชา \"โครงงานวิศวกรรมคอมพิวเตอร์ 1\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-212",
        "name": "โครงงานวิศวกรรมคอมพิวเตอร์ 2",
        "credit": "1",
        "description": "รายวิชา \"โครงงานวิศวกรรมคอมพิวเตอร์ 2\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-317",
        "name": "โครงงานวิศวกรรมคอมพิวเตอร์ 3",
        "credit": "1",
        "description": "รายวิชา \"โครงงานวิศวกรรมคอมพิวเตอร์ 3\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-012-318",
        "name": "โครงงานวิศวกรรมคอมพิวเตอร์ 4",
        "credit": "1",
        "description": "รายวิชา \"โครงงานวิศวกรรมคอมพิวเตอร์ 4\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-015-319",
        "name": "การเตรียมสหกิจศึกษา",
        "credit": "1",
        "description": "รายวิชา \"การเตรียมสหกิจศึกษา\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      },
      {
        "code": "EN-015-420",
        "name": "สหกิจศึกษา",
        "credit": "6(3-1-2)",
        "description": "รายวิชา \"สหกิจศึกษา\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
        "type": "ยังไม่เทียบ"
      }
    ]
  },
  "หมวดวิชาเลือกเสรี": [
    {
      "code": "XX-XXX-XXX",
      "name": "วิชาเลือกเสรี 1",
      "credit": "3",
      "description": "รายวิชา \"วิชาเลือกเสรี 1\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
      "type": "ยังไม่เทียบ"
    },
    {
      "code": "XX-XXX-XXX",
      "name": "วิชาเลือกเสรี 2",
      "credit": "3",
      "description": "รายวิชา \"วิชาเลือกเสรี 2\" มุ่งเน้นให้ผู้เรียนเข้าใจถึงหลักการ แนวคิด และองค์ความรู้ที่เกี่ยวข้องกับหัวข้อดังกล่าว โดยเนื้อหาครอบคลุมทั้งภาคทฤษฎีและภาคปฏิบัติ เพื่อเสริมสร้างทักษะการคิดวิเคราะห์ การประยุกต์ใช้ความรู้ในสถานการณ์จริง รวมถึงการพัฒนาทักษะที่จำเป็นในศตวรรษที่ 21 เช่น การทำงานเป็นทีม การสื่อสาร และการแก้ปัญหาอย่างสร้างสรรค์ ผู้เรียนจะได้เรียนรู้ผ่านการบรรยาย การอภิปราย กรณีศึกษา และกิจกรรมเชิงปฏิบัติการ เพื่อให้สามารถนำความรู้ไปใช้ได้อย่างมีประสิทธิภาพในชีวิตจริงและการทำงานในอนาคต",
      "type": "ยังไม่เทียบ"
    }
  ]
}